---
kind: event
id: E:Autodesk.Revit.UI.UIApplication.FormulaEditing
source: html/ff842cc8-67a9-2c51-843d-d17767e757a8.htm
---
# Autodesk.Revit.UI.UIApplication.FormulaEditing Event

Subscribe to the FormulaEditing event to be notified when the edit formula button has been clicked.

## Syntax (C#)
```csharp
public event EventHandler<FormulaEditingEventArgs> FormulaEditing
```